_posts/2014-09-05-Lets-commit.html
---
layout: post
title:  Let's commit
date:   2014-09-15T21:32:25+0200
---

<p>
What a year, two new hobbies and great people who support me. I've
built <b>five</b> RC planes and all of them flew for better or worse! If
you want to try it I recommend you visit <a href="http://flitetest.com">FliteTest</a> and see their
"Beginner's Series". Then build <a href="http://mikeysrc.com/Sport-Trainer.html">Mikey's RC Sport Trainer</a>. If you do it
like I did I can promise it will fly<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>.
</p>

<p>
Now that autumn is comming and the weather may not be favourable, I am
getting back to my Eventorbot. Yesterday I pushed a commit with
(almost) all plastic parts in OpenSCAD format. Those that are missing,
are not crucial like footings, which I intend to build from wood, or
completely unimportant like caps. The extruder is missing too, that is
because, I decided to use NEMA17 which requires the extruder to be
completely redesigned or I will use one of popular designes.
</p>

<p>
Today I've ordered a <a href="http://gadgets3d.com/index.php?route=product/product&path=62&product_id=87">set of parts</a> and a <a href="http://gadgets3d.com/index.php?route=product/product&path=60&product_id=79">spool of PLA</a>. In the next
couple of weeks I need to:
</p>

<ul class="org-ul">
<li>find a working 3d printer to&#x2026;
</li>
<li>print the plastic parts,
</li>
<li>prepare scad files with assemblies.
</li>
</ul>

<p>
Then the greatest challenge will be building the frame. I can't weld
so in one way or another I am going to get it built for me. Because
I'd like to have the machine <b>working</b> before Christmas I will
probably go to a laser-cutting-n-bending-n-welding shop since I expect
their price for the frame won't by significantly higher than for a
good hot-end. But that's not yet decided.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
If you live in Europe where you can't get Dolar Tree Foamboard,
you can use FOAM-X. The plane will be havier but with an EMAX C2822
(KV1200, 170W) and a GWS 9050 propeller there won't be any issues.
</p></div>


</div>
</div>
